name: "GoogleNet"
layer {
name:"data"
type:"Input"
top:"data"
input_param{shape:{dim:1 dim:3 dim:224 dim:224}}
}
layer {
  name: "conv1/7x7_s2"
  type: "Convolution"
  bottom: "data"
  top: "conv1/7x7_s2_inp"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
#### defender units for layer 1 #######
layer {
  name: "drop_inp"
  type: "Dropout"
  bottom: "conv1/7x7_s2_inp"
  top: "conv1/7x7_s2_inp"
  dropout_param {
    dropout_ratio: 0.25
  }
}
layer{
  bottom: "conv1/7x7_s2_inp"
  top: "conv1_imap"
  name: "conv1_imap"
  type: "Convolution"
    convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
   bias_term: false
 }
    param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer{
     bottom:"conv1_imap"
     top:"topranked_conv1"
     top:"bottomranked_conv1"
     name:"split_conv1"
     type:"Slice"
     slice_param{
     axis:1
     slice_point:32
     }
     }
layer{
  bottom: "topranked_conv1"
  top: "dc1_conv1"
  name: "dc1_conv1"
  type: "Convolution"
    convolution_param {
    num_output: 16
    pad: 0
    kernel_size: 1
    bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
}
layer{
     name:"dc1_bn1"
     bottom: "dc1_conv1"
     top: "dc1_bn1"
     type: "BatchNorm"
     param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
     batch_norm_param{
     use_global_stats:1
     }
}
layer{
     name:"dc1_scale1"
     bottom:"dc1_bn1"
     top:"dc1_scale1"
     type:"Scale"
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     scale_param{
     filler{
     value:1
     }
     bias_term: true
     bias_filler{
     value:0
     }
     }
}
layer {
  bottom: "dc1_scale1"
  top: "dc1_relu1"
  name: "dc1_relu1"
 type: "ReLU"
}
layer{
  bottom: "dc1_relu1"
  top: "dc1_conv2"
  name: "dc1_conv2"
  type: "Convolution"
    convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
}
layer{
     name:"dc1_bn2"
     bottom: "dc1_conv2"
     top: "dc1_bn2"
     type: "BatchNorm"
     param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
     batch_norm_param{
     use_global_stats: 1
     }
}
#
layer{
     name:"dc1_scale2"
     bottom:"dc1_bn2"
     top:"dc1_scale2"
     type:"Scale"
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     scale_param{
     filler{
     value:1
     }
     bias_term: true
     bias_filler{
     value:0
     }
     }
}
layer {
  bottom: "dc1_scale2"
  top: "dc1_relu2"
  name: "dc1_relu2"
  type: "ReLU"
}
layer{
  bottom: "dc1_relu2"
  top: "dc1_conv3"
  name: "dc1_conv3"
  type: "Convolution"
    convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}

layer{
     name:"dc1_bn3"
     bottom: "dc1_conv3"
     top: "dc1_bn3"
     type: "BatchNorm"
     param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
     batch_norm_param{
     use_global_stats: 1
     }
}

#
layer{
     name:"dc1_scale3"
    bottom:"dc1_bn3"
     top:"dc1_scale3"
     type:"Scale"
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     scale_param{
     filler{
     value:1
     }
     bias_term: true
     bias_filler{
     value:0
     }
     }
}
layer {
  bottom: "dc1_scale3"
  top: "dc1_relu3"
  name: "dc1_relu3"
  type: "ReLU"
}
layer{
  bottom: "dc1_relu3"
  top: "dc1_conv4"
  name: "dc1_conv4"
  type: "Convolution"
    convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
   bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}
layer{

   bottom:"topranked_conv1"
  bottom:"dc1_conv4"
   top:"dc1_merge"
   name:"dc1_merge"
   type: "Eltwise"
}
layer{
     name:"conv1_concat"
     bottom:"dc1_merge"
     bottom:"bottomranked_conv1"
     top:"conv1_concat"
     type:"Concat"
     concat_param{
     axis:1
     }
}
layer{
  bottom: "conv1_concat"
  top: "conv1_remap"
  name: "conv1_remap"
  type: "Convolution"
    convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
   bias_term: false
 }
    param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
#### end ##################################

layer {
  name: "conv1/relu_7x7"
  type: "ReLU"
  bottom: "conv1_remap"
  top: "conv1/7x7_s2"
}
layer {
  name: "pool1/3x3_s2"
  type: "Pooling"
  bottom: "conv1/7x7_s2"
  top: "pool1/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "pool1/norm1"
  type: "LRN"
  bottom: "pool1/3x3_s2"
  top: "pool1/norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2/3x3_reduce"
  type: "Convolution"
  bottom: "pool1/norm1"
  top: "conv2/3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv2/relu_3x3_reduce"
  type: "ReLU"
  bottom: "conv2/3x3_reduce"
  top: "conv2/3x3_reduce"
}
layer {
  name: "conv2/3x3"
  type: "Convolution"
  bottom: "conv2/3x3_reduce"
  top: "conv2/3x3_inp"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

####### defender unit for layer 2 #################

layer{
  bottom: "conv2/3x3_inp"
  top: "conv2_imap"
  name: "conv2_imap"
  type: "Convolution"
    convolution_param {
    num_output: 192
    pad: 0
    kernel_size: 1
   bias_term: false
 }
    param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer{
     bottom:"conv2_imap"
     top:"topranked_conv2"
     top:"bottomranked_conv2"
     name:"split_conv2"
     type:"Slice"
     slice_param{
     axis:1
     slice_point:96
     }
     }
layer{
  bottom: "topranked_conv2"
  top: "dc2_conv1"
  name: "dc2_conv1"
  type: "Convolution"
    convolution_param {
    num_output: 48
    pad: 0
    kernel_size: 1
    bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}
layer{
     name:"dc2_bn1"
     bottom: "dc2_conv1"
     top: "dc2_bn1"
     type: "BatchNorm"
     param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
     batch_norm_param{
     use_global_stats:1
     }
}
layer{
     name:"dc2_scale1"
     bottom:"dc2_bn1"
     top:"dc2_scale1"
     type:"Scale"
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     scale_param{
     filler{
     value:1
     }
     bias_term: true
     bias_filler{
     value:0
     }
     }
}
layer {
  bottom: "dc2_scale1"
  top: "dc2_relu1"
  name: "dc2_relu1"
 type: "ReLU"
}
#
#
layer{
  bottom: "dc2_relu1"
  top: "dc2_conv2"
  name: "dc2_conv2"
  type: "Convolution"
    convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
    bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
}
layer{
     name:"dc2_bn2"
     bottom: "dc2_conv2"
     top: "dc2_bn2"
     type: "BatchNorm"
     param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
     batch_norm_param{
     use_global_stats: 1
     }
}
layer{
     name:"dc2_scale2"
     bottom:"dc2_bn2"
     top:"dc2_scale2"
     type:"Scale"
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     scale_param{
     filler{
     value:1
     }
     bias_term: true
     bias_filler{
     value:0
     }
     }
}
layer {
  bottom: "dc2_scale2"
  top: "dc2_relu2"
  name: "dc2_relu2"
  type: "ReLU"
}
layer{
  bottom: "dc2_relu2"
  top: "dc2_conv3"
  name: "dc2_conv3"
  type: "Convolution"
    convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
    bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
}
layer{
     name:"dc2_bn3"
     bottom: "dc2_conv3"
     top: "dc2_bn3"
     type: "BatchNorm"
     param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
     batch_norm_param{
     use_global_stats: 1
     }
}
layer{
     name:"dc2_scale3"
    bottom:"dc2_bn3"
     top:"dc2_scale3"
     type:"Scale"
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     scale_param{
     filler{
     value:1
     }
     bias_term: true
     bias_filler{
     value:0
     }
     }
}
layer {
  bottom: "dc2_scale3"
  top: "dc2_relu3"
  name: "dc2_relu3"
  type: "ReLU"
}
layer{
  bottom: "dc2_relu3"
  top: "dc2_conv4"
  name: "dc2_conv4"
  type: "Convolution"
    convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 1
   bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}
#
layer{

   bottom:"topranked_conv2"
  bottom:"dc2_conv4"
   top:"dc2_merge"
   name:"dc2_merge"
   type: "Eltwise"

}
layer{
     name:"conv2_concat"
     bottom:"dc2_merge"
     bottom:"bottomranked_conv2"
     top:"conv2_concat"
     type:"Concat"
     concat_param{
     axis:1
     }
}
layer{
  bottom: "conv2_concat"
  top: "conv2_remap"
  name: "conv2_remap"
  type: "Convolution"
    convolution_param {
    num_output: 192
    pad: 0
    kernel_size: 1
   bias_term: false
 }
    param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
####### end ##################
layer {
  name: "conv2/relu_3x3"
  type: "ReLU"
  bottom: "conv2_remap"
  top: "conv2/3x3"
}
layer {
  name: "conv2/norm2"
  type: "LRN"
  bottom: "conv2/3x3"
  top: "conv2/norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "pool2/3x3_s2"
  type: "Pooling"
  bottom: "conv2/norm2"
  top: "pool2/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception_3a/1x1"
  type: "Convolution"
  bottom: "pool2/3x3_s2"
  top: "inception_3a/1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
        decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_1x1"
  type: "ReLU"
  bottom: "inception_3a/1x1"
  top: "inception_3a/1x1"
}
layer {
  name: "inception_3a/3x3_reduce"
  type: "Convolution"
  bottom: "pool2/3x3_s2"
  top: "inception_3a/3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_3a/3x3_reduce"
  top: "inception_3a/3x3_reduce"
}
layer {
  name: "inception_3a/3x3"
  type: "Convolution"
  bottom: "inception_3a/3x3_reduce"
  top: "inception_3a/3x3_inp"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

##### defender 3x3 inception 3a ######
layer{
  bottom: "inception_3a/3x3_inp"
  top: "inception_3a/3x3_imap"
  name: "inception_3a/3x3_imap"
  type: "Convolution"
    convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
   bias_term: false
 }
    param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}

layer{
     bottom:"inception_3a/3x3_imap"
     top:"topranked_inception_3a/3x3"
     top:"bottomranked_inception_3a/3x3"
     name:"split_inception_3a/3x3"
     type:"Slice"
     slice_param{
     axis:1
     slice_point:64
     }

     }

layer{
  bottom: "topranked_inception_3a/3x3"
  top: "inception_3a/3x3_conv1"
  name: "inception_3a/3x3_conv1"
  type: "Convolution"
    convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}
layer{
     name:"inception_3a/3x3_bn1"
     bottom: "inception_3a/3x3_conv1"
     top: "inception_3a/3x3_bn1"
     type: "BatchNorm"
     param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
     batch_norm_param{
     use_global_stats:1
     }
}
#
#
layer{
     name:"inception_3a/3x3_scale1"
     bottom:"inception_3a/3x3_bn1"
     top:"inception_3a/3x3_scale1"
     type:"Scale"
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     scale_param{
     filler{
     value:1
     }
     bias_term: true
     bias_filler{
     value:0
     }
     }
}
layer {
  bottom: "inception_3a/3x3_scale1"
  top: "inception_3a/3x3_relu1"
  name: "inception_3a/3x3_relu1"
 type: "ReLU"
}
#
#
layer{
  bottom: "inception_3a/3x3_relu1"
  top: "inception_3a/3x3_conv2"
  name: "inception_3a/3x3_conv2"
  type: "Convolution"
    convolution_param {
    num_output: 32
     pad: 1
    kernel_size: 3
    bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}
#
layer{
     name:"inception_3a/3x3_bn2"
     bottom: "inception_3a/3x3_conv2"
     top: "inception_3a/3x3_bn2"
     type: "BatchNorm"
     param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
     batch_norm_param{
     use_global_stats:1
     }
}
#
layer{
     name:"inception_3a/3x3_scale2"
     bottom:"inception_3a/3x3_bn2"
     top:"inception_3a/3x3_scale2"
     type:"Scale"
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     scale_param{
     filler{
     value:1
     }
     bias_term: true
     bias_filler{
     value:0
     }
     }
}
layer {
  bottom: "inception_3a/3x3_scale2"
  top: "inception_3a/3x3_relu2"
  name: "inception_3a/3x3_relu2"
  type: "ReLU"
}
layer{
  bottom: "inception_3a/3x3_relu2"
  top: "inception_3a/3x3_conv3"
  name: "inception_3a/3x3_conv3"
  type: "Convolution"
    convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}

layer{
     name:"inception_3a/3x3_bn3"
     bottom: "inception_3a/3x3_conv3"
     top: "inception_3a/3x3_bn3"
     type: "BatchNorm"
     param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
     batch_norm_param{
     use_global_stats: 1
     }
}
layer{
     name:"inception_3a/3x3_scale3"
    bottom:"inception_3a/3x3_bn3"
     top:"inception_3a/3x3_scale3"
     type:"Scale"
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     scale_param{
     filler{
     value:1
     }
     bias_term: true
     bias_filler{
     value:0
     }
     }
}
layer {
  bottom: "inception_3a/3x3_scale3"
  top: "inception_3a/3x3_relu3"
  name: "inception_3a/3x3_relu3"
  type: "ReLU"
}
#
layer{
  bottom: "inception_3a/3x3_relu3"
  top: "inception_3a/3x3_conv4"
  name: "inception_3a/3x3_conv4"
  type: "Convolution"
    convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
   bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}
#
layer{

   bottom:"topranked_inception_3a/3x3"
  bottom:"inception_3a/3x3_conv4"
   top:"inception_3a/3x3_merge"
   name:"inception_3a/3x3_merge"
   type: "Eltwise"

}
layer{
     name:"inception_3a/3x3_concat"
     bottom:"inception_3a/3x3_merge"
     bottom:"bottomranked_inception_3a/3x3"
     top:"inception_3a/3x3_concat"
     type:"Concat"
     concat_param{
     axis:1
     }

}

layer{
  bottom: "inception_3a/3x3_concat"
  top: "inception_3a/3x3_remap"
  name: "inception_3a/3x3_remap"
  type: "Convolution"
    convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
   bias_term: false
 }
    param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}

####### end #######################
layer {
  name: "inception_3a/relu_3x3"
  type: "ReLU"
  bottom: "inception_3a/3x3_remap"
  top: "inception_3a/3x3"
}
layer {
  name: "inception_3a/5x5_reduce"
  type: "Convolution"
  bottom: "pool2/3x3_s2"
  top: "inception_3a/5x5_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_5x5_reduce"
  type: "ReLU"
  bottom: "inception_3a/5x5_reduce"
  top: "inception_3a/5x5_reduce"
}
layer {
  name: "inception_3a/5x5"
  type: "Convolution"
  bottom: "inception_3a/5x5_reduce"
  top: "inception_3a/5x5_inp"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

##### defender 5x5 inception 3a ######
layer{
  bottom: "inception_3a/5x5_inp"
  top: "inception_3a/5x5_imap"
  name: "inception_3a/5x5_imap"
  type: "Convolution"
    convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
   bias_term: false
 }
    param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}

layer{
     bottom:"inception_3a/5x5_imap"
     top:"topranked_inception_3a/5x5"
     top:"bottomranked_inception_3a/5x5"
     name:"split_inception_3a/5x5"
     type:"Slice"
     slice_param{
     axis:1
     slice_point:16
     }

     }

layer{
  bottom: "topranked_inception_3a/5x5"
  top: "inception_3a/5x5_conv1"
  name: "inception_3a/5x5_conv1"
  type: "Convolution"
    convolution_param {
    num_output: 8
    pad: 0
    kernel_size: 1
    bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}
layer{
     name:"inception_3a/5x5_bn1"
     bottom: "inception_3a/5x5_conv1"
     top: "inception_3a/5x5_bn1"
     type: "BatchNorm"
     param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
     batch_norm_param{
     use_global_stats:1
     }
}
#
#
layer{
     name:"inception_3a/5x5_scale1"
     bottom:"inception_3a/5x5_bn1"
     top:"inception_3a/5x5_scale1"
     type:"Scale"
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     scale_param{
     filler{
     value:1
     }
     bias_term: true
     bias_filler{
     value:0
     }
     }
}
layer {
  bottom: "inception_3a/5x5_scale1"
  top: "inception_3a/5x5_relu1"
  name: "inception_3a/5x5_relu1"
 type: "ReLU"
}
#
#
layer{
  bottom: "inception_3a/5x5_relu1"
  top: "inception_3a/5x5_conv2"
  name: "inception_3a/5x5_conv2"
  type: "Convolution"
    convolution_param {
    num_output: 8
     pad: 1
    kernel_size: 3
    bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}
#
layer{
     name:"inception_3a/5x5_bn2"
     bottom: "inception_3a/5x5_conv2"
     top: "inception_3a/5x5_bn2"
     type: "BatchNorm"
     param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
     batch_norm_param{
     use_global_stats: 1
     }
}
#
layer{
     name:"inception_3a/5x5_scale2"
     bottom:"inception_3a/5x5_bn2"
     top:"inception_3a/5x5_scale2"
     type:"Scale"
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     scale_param{
     filler{
     value:1
     }
     bias_term: true
     bias_filler{
     value:0
     }
     }
}
layer {
  bottom: "inception_3a/5x5_scale2"
  top: "inception_3a/5x5_relu2"
  name: "inception_3a/5x5_relu2"
  type: "ReLU"
}
layer{
  bottom: "inception_3a/5x5_relu2"
  top: "inception_3a/5x5_conv3"
  name: "inception_3a/5x5_conv3"
  type: "Convolution"
    convolution_param {
    num_output: 8
    pad: 1
    kernel_size: 3
    bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}

layer{
     name:"inception_3a/5x5_bn3"
     bottom: "inception_3a/5x5_conv3"
     top: "inception_3a/5x5_bn3"
     type: "BatchNorm"
     param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
     batch_norm_param{
     use_global_stats: 1
     }
}
layer{
     name:"inception_3a/5x5_scale3"
    bottom:"inception_3a/5x5_bn3"
     top:"inception_3a/5x5_scale3"
     type:"Scale"
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     scale_param{
     filler{
     value:1
     }
     bias_term: true
     bias_filler{
     value:0
     }
     }
}
layer {
  bottom: "inception_3a/5x5_scale3"
  top: "inception_3a/5x5_relu3"
  name: "inception_3a/5x5_relu3"
  type: "ReLU"
}
#
layer{
  bottom: "inception_3a/5x5_relu3"
  top: "inception_3a/5x5_conv4"
  name: "inception_3a/5x5_conv4"
  type: "Convolution"
    convolution_param {
    num_output: 16
    pad: 0
    kernel_size: 1
   bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}
#
layer{

   bottom:"topranked_inception_3a/5x5"
  bottom:"inception_3a/5x5_conv4"
   top:"inception_3a/5x5_merge"
   name:"inception_3a/5x5_merge"
   type: "Eltwise"

}
layer{
     name:"inception_3a/5x5_concat"
     bottom:"inception_3a/5x5_merge"
     bottom:"bottomranked_inception_3a/5x5"
     top:"inception_3a/5x5_concat"
     type:"Concat"
     concat_param{
     axis:1
     }

}

layer{
  bottom: "inception_3a/5x5_concat"
  top: "inception_3a/5x5_remap"
  name: "inception_3a/5x5_remap"
  type: "Convolution"
    convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
   bias_term: false
 }
    param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}

####### end #######################

layer {
  name: "inception_3a/relu_5x5"
  type: "ReLU"
  bottom: "inception_3a/5x5_remap"
  top: "inception_3a/5x5"
}
layer {
  name: "inception_3a/pool"
  type: "Pooling"
  bottom: "pool2/3x3_s2"
  top: "inception_3a/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_3a/pool_proj"
  type: "Convolution"
  bottom: "inception_3a/pool"
  top: "inception_3a/pool_proj"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_pool_proj"
  type: "ReLU"
  bottom: "inception_3a/pool_proj"
  top: "inception_3a/pool_proj"
}
layer {
  name: "inception_3a/output"
  type: "Concat"
  bottom: "inception_3a/1x1"
  bottom: "inception_3a/3x3"
  bottom: "inception_3a/5x5"
  bottom: "inception_3a/pool_proj"
  top: "inception_3a/output"
}
layer {
  name: "inception_3b/1x1"
  type: "Convolution"
  bottom: "inception_3a/output"
  top: "inception_3b/1x1"
  param {
    lr_mult: 0
    decay_mult:0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_1x1"
  type: "ReLU"
  bottom: "inception_3b/1x1"
  top: "inception_3b/1x1"
}
layer {
  name: "inception_3b/3x3_reduce"
  type: "Convolution"
  bottom: "inception_3a/output"
  top: "inception_3b/3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_3b/3x3_reduce"
  top: "inception_3b/3x3_reduce"
}
layer {
  name: "inception_3b/3x3"
  type: "Convolution"
  bottom: "inception_3b/3x3_reduce"
  top: "inception_3b/3x3_inp"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}


##### defender 3x3 inception 3b ######
layer{
  bottom: "inception_3b/3x3_inp"
  top: "inception_3b/3x3_imap"
  name: "inception_3b/3x3_imap"
  type: "Convolution"
    convolution_param {
    num_output: 192
    pad: 0
    kernel_size: 1
   bias_term: false
 }
    param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}

layer{
     bottom:"inception_3b/3x3_imap"
     top:"topranked_inception_3b/3x3"
     top:"bottomranked_inception_3b/3x3"
     name:"split_inception_3b/3x3"
     type:"Slice"
     slice_param{
     axis:1
     slice_point:96
     }

     }

layer{
  bottom: "topranked_inception_3b/3x3"
  top: "inception_3b/3x3_conv1"
  name: "inception_3b/3x3_conv1"
  type: "Convolution"
    convolution_param {
    num_output: 48
    pad: 0
    kernel_size: 1
    bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}
layer{
     name:"inception_3b/3x3_bn1"
     bottom: "inception_3b/3x3_conv1"
     top: "inception_3b/3x3_bn1"
     type: "BatchNorm"
     param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
     batch_norm_param{
     use_global_stats:1
     }
}
#
#
layer{
     name:"inception_3b/3x3_scale1"
     bottom:"inception_3b/3x3_bn1"
     top:"inception_3b/3x3_scale1"
     type:"Scale"
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     scale_param{
     filler{
     value:1
     }
     bias_term: true
     bias_filler{
     value:0
     }
     }
}
layer {
  bottom: "inception_3b/3x3_scale1"
  top: "inception_3b/3x3_relu1"
  name: "inception_3b/3x3_relu1"
 type: "ReLU"
}
#
#
layer{
  bottom: "inception_3b/3x3_relu1"
  top: "inception_3b/3x3_conv2"
  name: "inception_3b/3x3_conv2"
  type: "Convolution"
    convolution_param {
    num_output: 48
     pad: 1
    kernel_size: 3
    bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}
#
layer{
     name:"inception_3b/3x3_bn2"
     bottom: "inception_3b/3x3_conv2"
     top: "inception_3b/3x3_bn2"
     type: "BatchNorm"
     param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
     batch_norm_param{
     use_global_stats: 1
     }
}
#
layer{
     name:"inception_3b/3x3_scale2"
     bottom:"inception_3b/3x3_bn2"
     top:"inception_3b/3x3_scale2"
     type:"Scale"
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     scale_param{
     filler{
     value:1
     }
     bias_term: true
     bias_filler{
     value:0
     }
     }
}
layer {
  bottom: "inception_3b/3x3_scale2"
  top: "inception_3b/3x3_relu2"
  name: "inception_3b/3x3_relu2"
  type: "ReLU"
}
layer{
  bottom: "inception_3b/3x3_relu2"
  top: "inception_3b/3x3_conv3"
  name: "inception_3b/3x3_conv3"
  type: "Convolution"
    convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
    bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}

layer{
     name:"inception_3b/3x3_bn3"
     bottom: "inception_3b/3x3_conv3"
     top: "inception_3b/3x3_bn3"
     type: "BatchNorm"
     param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
     batch_norm_param{
     use_global_stats: 1
     }
}
layer{
     name:"inception_3b/3x3_scale3"
    bottom:"inception_3b/3x3_bn3"
     top:"inception_3b/3x3_scale3"
     type:"Scale"
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     scale_param{
     filler{
     value:1
     }
     bias_term: true
     bias_filler{
     value:0
     }
     }
}
layer {
  bottom: "inception_3b/3x3_scale3"
  top: "inception_3b/3x3_relu3"
  name: "inception_3b/3x3_relu3"
  type: "ReLU"
}
#
layer{
  bottom: "inception_3b/3x3_relu3"
  top: "inception_3b/3x3_conv4"
  name: "inception_3b/3x3_conv4"
  type: "Convolution"
    convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 1
   bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}
#
layer{

   bottom:"topranked_inception_3b/3x3"
  bottom:"inception_3b/3x3_conv4"
   top:"inception_3b/3x3_merge"
   name:"inception_3b/3x3_merge"
   type: "Eltwise"

}
layer{
     name:"inception_3b/3x3_concat"
     bottom:"inception_3b/3x3_merge"
     bottom:"bottomranked_inception_3b/3x3"
     top:"inception_3b/3x3_concat"
     type:"Concat"
     concat_param{
     axis:1
     }

}

layer{
  bottom: "inception_3b/3x3_concat"
  top: "inception_3b/3x3_remap"
  name: "inception_3b/3x3_remap"
  type: "Convolution"
    convolution_param {
    num_output: 192
    pad: 0
    kernel_size: 1
   bias_term: false
 }
    param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}

####### end #######################

layer {
  name: "inception_3b/relu_3x3"
  type: "ReLU"
  bottom: "inception_3b/3x3_remap"
  top: "inception_3b/3x3"
}
layer {
  name: "inception_3b/5x5_reduce"
  type: "Convolution"
  bottom: "inception_3a/output"
  top: "inception_3b/5x5_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_5x5_reduce"
  type: "ReLU"
  bottom: "inception_3b/5x5_reduce"
  top: "inception_3b/5x5_reduce"
}
layer {
  name: "inception_3b/5x5"
  type: "Convolution"
  bottom: "inception_3b/5x5_reduce"
  top: "inception_3b/5x5_inp"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
##### defender 5x5 inception 3b######
layer{
  bottom: "inception_3b/5x5_inp"
  top: "inception_3b/5x5_imap"
  name: "inception_3b/5x5_imap"
  type: "Convolution"
    convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 1
   bias_term: false
 }
    param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}

layer{
     bottom:"inception_3b/5x5_imap"
     top:"topranked_inception_3b/5x5"
     top:"bottomranked_inception_3b/5x5"
     name:"split_inception_3b/5x5"
     type:"Slice"
     slice_param{
     axis:1
     slice_point:48
     }

     }

layer{
  bottom: "topranked_inception_3b/5x5"
  top: "inception_3b/5x5_conv1"
  name: "inception_3b/5x5_conv1"
  type: "Convolution"
    convolution_param {
    num_output: 24
    pad: 0
    kernel_size: 1
    bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}
layer{
     name:"inception_3b/5x5_bn1"
     bottom: "inception_3b/5x5_conv1"
     top: "inception_3b/5x5_bn1"
     type: "BatchNorm"
     param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
     batch_norm_param{
     use_global_stats:1
     }
}
#
#
layer{
     name:"inception_3b/5x5_scale1"
     bottom:"inception_3b/5x5_bn1"
     top:"inception_3b/5x5_scale1"
     type:"Scale"
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     scale_param{
     filler{
     value:1
     }
     bias_term: true
     bias_filler{
     value:0
     }
     }
}
layer {
  bottom: "inception_3b/5x5_scale1"
  top: "inception_3b/5x5_relu1"
  name: "inception_3b/5x5_relu1"
 type: "ReLU"
}
#
#
layer{
  bottom: "inception_3b/5x5_relu1"
  top: "inception_3b/5x5_conv2"
  name: "inception_3b/5x5_conv2"
  type: "Convolution"
    convolution_param {
    num_output: 24
     pad: 1
    kernel_size: 3
    bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}
#
layer{
     name:"inception_3b/5x5_bn2"
     bottom: "inception_3b/5x5_conv2"
     top: "inception_3b/5x5_bn2"
     type: "BatchNorm"
     param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
     batch_norm_param{
     use_global_stats: 1
     }
}
#
layer{
     name:"inception_3b/5x5_scale2"
     bottom:"inception_3b/5x5_bn2"
     top:"inception_3b/5x5_scale2"
     type:"Scale"
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     scale_param{
     filler{
     value:1
     }
     bias_term: true
     bias_filler{
     value:0
     }
     }
}
layer {
  bottom: "inception_3b/5x5_scale2"
  top: "inception_3b/5x5_relu2"
  name: "inception_3b/5x5_relu2"
  type: "ReLU"
}
layer{
  bottom: "inception_3b/5x5_relu2"
  top: "inception_3b/5x5_conv3"
  name: "inception_3b/5x5_conv3"
  type: "Convolution"
    convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
    bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}

layer{
     name:"inception_3b/5x5_bn3"
     bottom: "inception_3b/5x5_conv3"
     top: "inception_3b/5x5_bn3"
     type: "BatchNorm"
     param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
     batch_norm_param{
     use_global_stats: 1
     }
}
layer{
     name:"inception_3b/5x5_scale3"
    bottom:"inception_3b/5x5_bn3"
     top:"inception_3b/5x5_scale3"
     type:"Scale"
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     scale_param{
     filler{
     value:1
     }
     bias_term: true
     bias_filler{
     value:0
     }
     }
}
layer {
  bottom: "inception_3b/5x5_scale3"
  top: "inception_3b/5x5_relu3"
  name: "inception_3b/5x5_relu3"
  type: "ReLU"
}
#
layer{
  bottom: "inception_3b/5x5_relu3"
  top: "inception_3b/5x5_conv4"
  name: "inception_3b/5x5_conv4"
  type: "Convolution"
    convolution_param {
    num_output: 48
    pad: 0
    kernel_size: 1
   bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}
#
layer{

   bottom:"topranked_inception_3b/5x5"
  bottom:"inception_3b/5x5_conv4"
   top:"inception_3b/5x5_merge"
   name:"inception_3b/5x5_merge"
   type: "Eltwise"

}
layer{
     name:"inception_3b/5x5_concat"
     bottom:"inception_3b/5x5_merge"
     bottom:"bottomranked_inception_3b/5x5"
     top:"inception_3b/5x5_concat"
     type:"Concat"
     concat_param{
     axis:1
     }

}

layer{
  bottom: "inception_3b/5x5_concat"
  top: "inception_3b/5x5_remap"
  name: "inception_3b/5x5_remap"
  type: "Convolution"
    convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 1
   bias_term: false
 }
    param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}

####### end #######################


layer {
  name: "inception_3b/relu_5x5"
  type: "ReLU"
  bottom: "inception_3b/5x5_remap"
  top: "inception_3b/5x5"
}
layer {
  name: "inception_3b/pool"
  type: "Pooling"
  bottom: "inception_3a/output"
  top: "inception_3b/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_3b/pool_proj"
  type: "Convolution"
  bottom: "inception_3b/pool"
  top: "inception_3b/pool_proj"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_pool_proj"
  type: "ReLU"
  bottom: "inception_3b/pool_proj"
  top: "inception_3b/pool_proj"
}
layer {
  name: "inception_3b/output"
  type: "Concat"
  bottom: "inception_3b/1x1"
  bottom: "inception_3b/3x3"
  bottom: "inception_3b/5x5"
  bottom: "inception_3b/pool_proj"
  top: "inception_3b/output"
}
layer {
  name: "pool3/3x3_s2"
  type: "Pooling"
  bottom: "inception_3b/output"
  top: "pool3/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception_4a/1x1"
  type: "Convolution"
  bottom: "pool3/3x3_s2"
  top: "inception_4a/1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_1x1"
  type: "ReLU"
  bottom: "inception_4a/1x1"
  top: "inception_4a/1x1"
}
layer {
  name: "inception_4a/3x3_reduce"
  type: "Convolution"
  bottom: "pool3/3x3_s2"
  top: "inception_4a/3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_4a/3x3_reduce"
  top: "inception_4a/3x3_reduce"
}
layer {
  name: "inception_4a/3x3"
  type: "Convolution"
  bottom: "inception_4a/3x3_reduce"
  top: "inception_4a/3x3_inp"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 208
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
###### defender unit for inception_4a/3x3 #######
layer{
  bottom: "inception_4a/3x3_inp"
  top: "inception_4a/3x3_imap"
  name: "inception_4a/3x3_imap"
  type: "Convolution"
    convolution_param {
    num_output: 208
    pad: 0
    kernel_size: 1
   bias_term: false
 }
    param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}

layer{
     bottom:"inception_4a/3x3_imap"
     top:"topranked_inception_4a/3x3"
     top:"bottomranked_inception_4a/3x3"
     name:"split_inception_4a/3x3"
     type:"Slice"
     slice_param{
     axis:1
     slice_point:104
     }

     }

layer{
  bottom: "topranked_inception_4a/3x3"
  top: "inception_4a/3x3_conv1"
  name: "inception_4a/3x3_conv1"
  type: "Convolution"
    convolution_param {
    num_output: 52
    pad: 0
    kernel_size: 1
    bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}
layer{
     name:"inception_4a/3x3_bn1"
     bottom: "inception_4a/3x3_conv1"
     top: "inception_4a/3x3_bn1"
     type: "BatchNorm"
     param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
     batch_norm_param{
     use_global_stats:1
     }
}
#
#
layer{
     name:"inception_4a/3x3_scale1"
     bottom:"inception_4a/3x3_bn1"
     top:"inception_4a/3x3_scale1"
     type:"Scale"
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     scale_param{
     filler{
     value:1
     }
     bias_term: true
     bias_filler{
     value:0
     }
     }
}
layer {
  bottom: "inception_4a/3x3_scale1"
  top: "inception_4a/3x3_relu1"
  name: "inception_4a/3x3_relu1"
 type: "ReLU"
}
#
#
layer{
  bottom: "inception_4a/3x3_relu1"
  top: "inception_4a/3x3_conv2"
  name: "inception_4a/3x3_conv2"
  type: "Convolution"
    convolution_param {
    num_output: 52
     pad: 1
    kernel_size: 3
    bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}
#
layer{
     name:"inception_4a/3x3_bn2"
     bottom: "inception_4a/3x3_conv2"
     top: "inception_4a/3x3_bn2"
     type: "BatchNorm"
     param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
     batch_norm_param{
     use_global_stats:1
     }
}
#
layer{
     name:"inception_4a/3x3_scale2"
     bottom:"inception_4a/3x3_bn2"
     top:"inception_4a/3x3_scale2"
     type:"Scale"
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     scale_param{
     filler{
     value:1
     }
     bias_term: true
     bias_filler{
     value:0
     }
     }
}
layer {
  bottom: "inception_4a/3x3_scale2"
  top: "inception_4a/3x3_relu2"
  name: "inception_4a/3x3_relu2"
  type: "ReLU"
}
layer{
  bottom: "inception_4a/3x3_relu2"
  top: "inception_4a/3x3_conv3"
  name: "inception_4a/3x3_conv3"
  type: "Convolution"
    convolution_param {
    num_output: 52
    pad: 1
    kernel_size: 3
    bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}

layer{
     name:"inception_4a/3x3_bn3"
     bottom: "inception_4a/3x3_conv3"
     top: "inception_4a/3x3_bn3"
     type: "BatchNorm"
     param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
     batch_norm_param{
     use_global_stats: 1
     }
}
layer{
     name:"inception_4a/3x3_scale3"
    bottom:"inception_4a/3x3_bn3"
     top:"inception_4a/3x3_scale3"
     type:"Scale"
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     scale_param{
     filler{
     value:1
     }
     bias_term: true
     bias_filler{
     value:0
     }
     }
}
layer {
  bottom: "inception_4a/3x3_scale3"
  top: "inception_4a/3x3_relu3"
  name: "inception_4a/3x3_relu3"
  type: "ReLU"
}
#
layer{
  bottom: "inception_4a/3x3_relu3"
  top: "inception_4a/3x3_conv4"
  name: "inception_4a/3x3_conv4"
  type: "Convolution"
    convolution_param {
    num_output: 104
    pad: 0
    kernel_size: 1
   bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}
#
layer{

   bottom:"topranked_inception_4a/3x3"
  bottom:"inception_4a/3x3_conv4"
   top:"inception_4a/3x3_merge"
   name:"inception_4a/3x3_merge"
   type: "Eltwise"

}
layer{
     name:"inception_4a/3x3_concat"
     bottom:"inception_4a/3x3_merge"
     bottom:"bottomranked_inception_4a/3x3"
     top:"inception_4a/3x3_concat"
     type:"Concat"
     concat_param{
     axis:1
     }

}

layer{
  bottom: "inception_4a/3x3_concat"
  top: "inception_4a/3x3_remap"
  name: "inception_4a/3x3_remap"
  type: "Convolution"
    convolution_param {
    num_output: 208
    pad: 0
    kernel_size: 1
   bias_term: false
 }
    param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
##### end ###############################
layer {
  name: "inception_4a/relu_3x3"
  type: "ReLU"
  bottom: "inception_4a/3x3_remap"
  top: "inception_4a/3x3"
}
layer {
  name: "inception_4a/5x5_reduce"
  type: "Convolution"
  bottom: "pool3/3x3_s2"
  top: "inception_4a/5x5_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_5x5_reduce"
  type: "ReLU"
  bottom: "inception_4a/5x5_reduce"
  top: "inception_4a/5x5_reduce"
}
layer {
  name: "inception_4a/5x5"
  type: "Convolution"
  bottom: "inception_4a/5x5_reduce"
  top: "inception_4a/5x5_inp"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

##### defender 5x5 inception 4a ######
layer{
  bottom: "inception_4a/5x5_inp"
  top: "inception_4a/5x5_imap"
  name: "inception_4a/5x5_imap"
  type: "Convolution"
    convolution_param {
    num_output: 48
    pad: 0
    kernel_size: 1
   bias_term: false
 }
    param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}

layer{
     bottom:"inception_4a/5x5_imap"
     top:"topranked_inception_4a/5x5"
     top:"bottomranked_inception_4a/5x5"
     name:"split_inception_4a/5x5"
     type:"Slice"
     slice_param{
     axis:1
     slice_point:24
     }

     }

layer{
  bottom: "topranked_inception_4a/5x5"
  top: "inception_4a/5x5_conv1"
  name: "inception_4a/5x5_conv1"
  type: "Convolution"
    convolution_param {
    num_output: 12
    pad: 0
    kernel_size: 1
    bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}
layer{
     name:"inception_4a/5x5_bn1"
     bottom: "inception_4a/5x5_conv1"
     top: "inception_4a/5x5_bn1"
     type: "BatchNorm"
     param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
     batch_norm_param{
     use_global_stats:1
     }
}
#
#
layer{
     name:"inception_4a/5x5_scale1"
     bottom:"inception_4a/5x5_bn1"
     top:"inception_4a/5x5_scale1"
     type:"Scale"
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     scale_param{
     filler{
     value:1
     }
     bias_term: true
     bias_filler{
     value:0
     }
     }
}
layer {
  bottom: "inception_4a/5x5_scale1"
  top: "inception_4a/5x5_relu1"
  name: "inception_4a/5x5_relu1"
 type: "ReLU"
}
#
#
layer{
  bottom: "inception_4a/5x5_relu1"
  top: "inception_4a/5x5_conv2"
  name: "inception_4a/5x5_conv2"
  type: "Convolution"
    convolution_param {
    num_output: 12
     pad: 1
    kernel_size: 3
    bias_term: false
        weight_filler {
      type: "msra"
    }
  }
    param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

}
#
layer{
     name:"inception_4a/5x5_bn2"
     bottom: "inception_4a/5x5_conv2"
     top: "inception_4a/5x5_bn2"
     type: "BatchNorm"
     param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
          param{
     lr_mult:0
     decay_mult: 0
     }
     batch_norm_param{
     use_global_stats: 1
     }
}
#
layer{
     name:"inception_4a/5x5_scale2"
     bottom:"inception_4a/5x5_bn2"
     top:"inception_4a/5x5_scale2"
     type:"Scale"
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     param{
     lr_mult: 1.0
     decay_mult:0.0
     }
     scale_param{
     filler{
     value:1
     }
     bias_term: true
     bias_filler{
     value:0
     }
     }
}
layer {
  bottom: "inception_4a/5x5_scale2"
  top: "inception_4a/5x5_relu2"
  name: "inception_4a/5x5_relu2"
  type: "ReLU"
}
layer{
  bottom: "inception_4a/5x5_relu2"
  top: "inception_4a/5x5_conv3"
  name: "inception_4a/5x5_conv3"
  type: "Convolution"
    convolution_param {
    num_output: 12
    pad: 1
    kernel_size: 3
    bias_term: false
        weight_filler {
      type: "msra"
    }
  }
